export default [
  {
    id: 1,
    name: "华宇集团内部信息化",
    role: "全栈设计开发",
    date: "2020-12 至今",
    decription:
      "此项目为华宇集团内部全流程全业务信息化项目，立项于2015年。整体采用Artery5(ssm+jQuery)，为微应用架构雏形，数据库为ArteryBase（基于posrgresql封装）。随着业务的发展与系统更新，正逐步将前台替换为基于vue3.0的微前端架构。项目中作为技术负责人，主要负责业务功能模块的设计与开发，项目疑难问题定位处理，系统性能优化与前端易用性优化。",
  },
  {
    id: 2,
    name: "华宇清单配置工具客户端",
    role: "系统设计实现",
    date: "2020-09 至 2020-12",
    decription:
      "此工具为北京华宇信息内部规划的cs架构的Windows桌面程序，支持离线操作。目的是简化公司咨询师制作合同清单时流程，提升制作清单的效率与准确性。项目前端是用electron-vue+vue3.0，基础ui使用elementUI，表格部分使用开源的高性能表格组件vxe-table，后台为springboot。前后台同时安装在用户的pc机上，通过bat脚本同时启动，inno setup工具制作windows安装包。项目中除了进行技术选型与功能设计开发外，同时负责目标用户的需求调研与后续使用的意见建议跟踪。协助项目经理制定开发版本周期与内容。",
  },
  {
    id: 3,
    name: "房山区检察院服务e站微信小程序",
    role: "全栈开发",
    date: "2020-06 至 2020-09",
    decription:
      "此项目为北京房山区检察院统建，旨在通过微信小程序上搭建一套集律师服务，公众服务以及检察院工作动态于一体的便民平台。项目后台历史比较久远，为SSH架构，数据库为oracle。项目中作为前后台开发，除了需求的设计开发外，同时负责与驻地现场同事沟通后续需求与使用问题，协助项目经理制定版本开发计划。经过一个月4个小版本的迅速迭代，高速高质量的完成了客户的需求，大幅缓和了原本紧张的客户关系。",
  },
  {
    id: 4,
    name: "华宇信息销售管理微应用（移动端）",
    role: "全栈设计开发",
    date: "2020-03 至 2020-06",
    decription:
      "此项目为北京华宇信息内部项目，旨在规范公司销售业务，对商机信息进行统一维护，同时对公司销售人员进行量化考核。由于销售常年出差奔波的岗位性质，所以大部分业务由手机端完成。项目前端为vue+vant，后台为Artery5（基于SSM+jQuery封装），数据库为ArteryBase（基于postgresql封装）。项目中做为前后端的设计开发，负责前端组件设计与实现，前后接口联调，项目部署实施与线上需求问题跟踪。",
  },
  {
    id: 5,
    name: "华宇文书智能送达管家",
    role: "全栈开发",
    date: "2020-01 至 2020-03",
    decription:
      "此项目为华宇自有产品，旨在将原始的线下文书送达进行线上规范化，对送达结果可视化，同时提供相关接口配合其他业务系统使用。项目整体为Arttery5（基于SSM+jQuery封装）架构，数据库为ArteryBase（基于postgresql封装）项目中作为前后台开发，对原电子送达组件（vue2.0）进行重构，精简代码体量，提高原电子送达组件整体质量",
  },
  {
    id: 6,
    name: "法院电子档案管理系统",
    role: "全栈设计开发",
    date: "2018-10 至 2019-12",
    decription:
      "此系统为华宇集团自主研发的产品，目的在于实现全国法院的档案全流程无纸化管理，并提供多种接口满足其他业务系统对接需求。项目后台使用springboot，前端vue、部署在nginx下，同时使用nginx对后台多节点进行反向代理。数据库为postgresql。项目期间主要工作为需求的前后端设计开发，git管理。项目上线后支持全国各地实施部署，协助项目经理进行各地需求统计规划。",
  },
  {
    id: 7,
    name: "辽宁法院信访立案与终结系统",
    role: "Java开发",
    date: "2018-07 至 2018-10",
    decription:
      "此项目为辽宁高院统建信访业务信息化项目。项目整体架构为artery5（基于SSM+jQuery封装）。项目中担任前后台开发，主要负责信访案件办理与上报，多格式附件在线预览的需求的开发实现。项目上线验收前在大连中院与辽宁高院驻地同事远程协作，对上线前的系统做收敛验证与部署支持。保证了第二天的顺利验收",
  },
];
